Autodesk.Revit.DB.WallSweep.WallAllowsWallSweep(Autodesk.Revit.DB.Wall)
Validates that the wall is of a type that may be a host for a wall sweep or reveal.
Remarks:
This function excludes curtain walls and the main wall of a set of stacked walls.
The wall must be fully regenerated for this function to work correctly.
wall:
The wall.
Returns:
True if the wall may host a wall sweep, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WallSweep.Create(Autodesk.Revit.DB.Wall,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.WallSweepInfo)
Creates a new wall sweep or reveal.
Remarks:
The wall sweep's profile and type are taken from the wall sweep type properties.  The
values set in the WallSweepInfo are ignored.
wall:
The wall upon which to create the new sweep or reveal.
wallSweepType:
The wall sweep or reveal type.
wallSweepInfo:
The information that describes the new wall sweep or reveal.
Returns:
The new wall sweep.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The wall sweep info represents a fixed wall sweep.  Fixed wall sweeps may not be assigned to standalone wall sweep elements.
-or-
The WallSweepInfo id must be set to -1 for a non-fixed wall sweep.
-or-
wall may not host a wall sweep or reveal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WallSweep.GetHostIds
Gets a list of all host walls on which the sweep resides.
Remarks:
Fixed wall sweeps from vertically compound structures will return only one host element.
Returns:
The list of wall ids.
Since:
2012

Autodesk.Revit.DB.WallSweep.GetWallSweepInfo
Gets the information of the wall sweep or reveal.
Returns:
The information that describes the wall sweep or reveal.
Since:
2012

Autodesk.Revit.DB.WallSweep
Represents a wall sweep or reveal.
Remarks:
This element may represent either a standalone sweep or reveal element created by the Revit user interface
or API, or a "fixed" wall sweep or reveal that was created by the contents of a wall's compound structure.
Since:
2012